app/views/customers/show.html.erb


<%= @customer.name %> has <%= @customer.orders.count %> orders:<br><br>
<% @customer.orders.each do |order| %>
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 6]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 6]]

<br>
<% @customer.sushis.uniq.each do |sushi| %>
<%= @customer.name %> has ordered <%= link_to sushi.name, sushi_path(sushi), method: :get %> <%= @customer.orders.select { |order| order.sushi.name == sushi.name }.count %> time(s).<br>
---
SELECT "sushis".* FROM "sushis" INNER JOIN "orders" ON "sushis"."id" = "orders"."sushi_id" WHERE "orders"."customer_id" = ?  [["customer_id", 6]]
SELECT "sushis".* FROM "sushis" WHERE "sushis"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

<h3><%= @customer.name %> has reviewed the following sushis:<br></h3>
<% @customer.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."customer_id" = ?  [["customer_id", 6]]