app/views/sushis/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 1]]
---
<%= link_to sushi.ocean.name, ocean_path(sushi.ocean.id), method: :get %>
<% if sushi.reviews.count > 0 %>