app/views/sushis/show.html.erb

<%= link_to @sushi.ocean.name, ocean_path(@sushi.ocean.id), method: :get %>
<% if @sushi.reviews.count > 0 %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 5]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 1]]

<h3>All Reviews</h3>
<% @sushi.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 12]]