app/views/oceans/show.html.erb

<%= @ocean.name %>, which has the following sushi(s):<br><br>
<% @ocean.sushis.each do |sushi| %>
---
SELECT "sushis".* FROM "sushis" WHERE "sushis"."ocean_id" = ?  [["ocean_id", 2]]