app/views/reviews/edit.html.erb

<%= f.label :customer_id, 'Customer' %>
<%= f.collection_select :customer_id, Customer.all, :id, :name %>
---
SELECT "customers".* FROM "customers"

<%= f.label :sushi_id, 'Sushi' %>
<%= f.collection_select :sushi_id, Sushi.all, :id, :name %>
---
SELECT "sushis".* FROM "sushis"