app/views/reviews/new.html.erb

    <%= f.label :customer_id, 'Customer' %>
    <%= f.collection_select :customer_id, Customer.all, :id, :name, :selected => Customer.last.id %>
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ?  [["LIMIT", 1]]

    <%= f.label :sushi_id, 'Sushi' %>
    <%= f.collection_select :sushi_id, Sushi.all, :id, :name, :selected => Order.last.sushi.id %>
---
SELECT "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "sushis".* FROM "sushis" WHERE "sushis"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]